import { StickyScroll } from "./ui/sticky-scroll-reveal";

const content = [
  {
    title: "মাননীয় উপদেষ্টা",
    description:
      "জনাব মোঃ নাহিদ ইসলাম, মাননীয় উপদেষ্টা। তিনি (জন্ম 1998) একজন বাংলাদেশী ছাত্র কর্মী। তিনি 8 আগস্ট, 2024 সাল থেকে বাংলাদেশের অন্তর্বর্তী সরকারের আইসিটি উপদেষ্টা ছিলেন। তিনি বৈষম্য বিরোধী ছাত্র আন্দোলনের অন্যতম প্রধান সমন্বয়ক ছিলেন, যা 2024 সালের বাংলাদেশ কোটা সংস্কার আন্দোলনের নেতৃত্ব দিয়েছিল, যা পরবর্তীতে প্রধানমন্ত্রী শেখ হাসিনার সরকারকে উৎখাত করার জন্য একটি অসহযোগ আন্দোলনে পরিণত হয়েছিল, দুর্ভাগ্যবশত প্রতিবাদকারীদের 'রাজাকার 'বলা হয়। তিনি বর্তমানে প্রধান উপদেষ্টা, নোবেল শান্তি পুরস্কার বিজয়ী মুহাম্মদ ইউনূসের অধীনে দায়িত্ব পালন করছেন। নাহিদ ইসলামের ডাকনাম 'ফাহিম'। তার জন্ম ১৯৯৮ সালে ঢাকায়। বাবা শিক্ষক ও মা গৃহিনী। তার ছোট এক ভাই আছে। ২০১৪ সালে ঢাকার দক্ষিণ বনশ্রী মডেল হাইস্কুল থেকে এসএসসি পাস করেন তিনি। সরকারি বিজ্ঞান কলেজ থেকে ২০১৬ সালে এইচএসি পাস করে ভর্তি হন ঢাকা বিশ্ববিদ্যালয়ের সমাজবিজ্ঞান বিভাগে। ২০২২ সালে অনার্স পাস করেন তিনি। বর্তমানে তিনি একই বিভাগে মাস্টার্সের শিক্ষার্থী। নাহিদ বিবাহিত। আন্দোলনকারী ছাড়াও তার রয়েছে রাজনৈতিক পরিচয়। তিনি গণতান্ত্রিক ছাত্রশক্তির কেন্দ্রীয় নেতা।",
    content: (
      <div className="h-full w-full bg-[linear-gradient(to_bottom_right,var(--cyan-500),var(--emerald-500))] flex items-center justify-center text-white">
        <img
          width={300}
          height={300}
          className="h-full w-full object-contain"
          src="/Honorable Adviser.png"
          alt="Honorable Advisor Image"
        />
      </div>
    ),
  },
  {
    title: "সচিব",
    description:
      "জনাব মোঃ শামসুল আরেফিন বর্তমানে তথ্য ও যোগাযোগ প্রযুক্তি বিভাগের সচিব হিসেবে দায়িত্ব পালন করছেন। এর আগে, তিনি বাংলাদেশের মন্ত্রিপরিষদ বিভাগে সমন্বয় ও সংস্কার সচিবের পদে অধিষ্ঠিত ছিলেন। এর আগে তিনি একই বিভাগে যুগ্ম সচিব ও অতিরিক্ত সচিব হিসেবে দায়িত্ব পালন করেন। তিনি মানিকগঞ্জ জেলার সহকারী কমিশনার ও ম্যাজিস্ট্রেট হিসেবে 1লা এপ্রিল, 1993 তারিখে তার কর্মজীবন শুরু করেন। তিনি বাংলাদেশ সিভিল সার্ভিস (প্রশাসন) ক্যাডারের সদস্য এবং বিসিএস-১১তম ব্যাচের সদস্য। তিনি বি.কম. (অনার্স) এবং এম.কম. ঢাকা বিশ্ববিদ্যালয়ের অর্থ বিভাগ থেকে। জনাব আরেফিন তার কর্মজীবনে দেশের বিভিন্ন স্থানে ম্যাজিস্ট্রেট, সহকারী কমিশনার (ভূমি), ইউএনও এবং ডিসিসহ মাঠ প্রশাসনের অনেক গুরুত্বপূর্ণ পদে দায়িত্ব পালন করেছেন। এছাড়াও, তিনি আবাসন অধিদপ্তরের উপ-পরিচালক, খাদ্য ও দুর্যোগ ব্যবস্থাপনা মন্ত্রণালয়ের সিনিয়র সহকারী সচিব, অর্থনৈতিক সম্পর্ক বিভাগের উপসচিব এবং রাজধানী উন্নয়ন কোত্রীপোখের (রাজউক) পরিচালক হিসেবে দায়িত্ব পালন করেছেন। এছাড়াও তিনি থানা নির্বাচন অফিসার, সহকারী রিটার্নিং অফিসার এবং জাতীয় ও স্থানীয় সরকার পর্যায়ের নির্বাচনে রিটার্নিং অফিসার হিসেবে কাজ করেছেন। তার দীর্ঘ কর্মজীবনে, জনাব আরেফিন বিভিন্ন সভা, কর্মশালা এবং সেমিনারে সক্রিয়ভাবে অংশগ্রহণ করেছেন, যার মধ্যে রয়েছে আঞ্চলিক, দ্বিপাক্ষিক এবং বহুপাক্ষিক বৈঠকসহ বিভিন্ন আলোচনার বিষয়ে, দেশে এবং বিদেশে। বার্ষিক কর্মসম্পাদন চুক্তি (APA), ন্যাশনাল ইন্টিগ্রিটি স্ট্র্যাটেজি (NIS), এবং Grievance Redress System (GRS)-এর প্রস্তুতি, পর্যবেক্ষণ, এবং মূল্যায়নে তার অভিজ্ঞতা রয়েছে। তিনি ভারতে 'সুশাসনের উপর বিশেষ প্রশিক্ষণ', মার্কিন যুক্তরাষ্ট্রে 'প্রফেশনাল ডেভেলপমেন্ট প্রোগ্রাম' এবং অস্ট্রেলিয়ায় 'প্রজেক্ট ম্যানেজমেন্ট' সহ দেশে এবং বিদেশে বেশ কয়েকটি প্রশিক্ষণ কোর্সে অংশগ্রহণ করেছেন। তিনি ভারত, জাপান, মার্কিন যুক্তরাষ্ট্র এবং অস্ট্রেলিয়া সহ বেশ কয়েকটি দেশ সফর করেছেন এবং স্পিকার বা প্যানেলিস্ট হিসাবে বিভিন্ন সেমিনার এবং কর্মশালায় যোগ দিয়েছেন। জনাব আরেফিন বিবাহিত এবং দুই পুত্রের আশীর্বাদপুষ্ট। তার ভিশন হলো দেশ সেবা করা।",
    content: (
      <div className="h-full w-full  flex items-center justify-center text-white">
        <img
          src="/Honorable Secretary Sir.png"
          width={300}
          height={300}
          className="h-full w-full object-contain"
          alt="Honorable Secretary"
        />
      </div>
    ),
  },
];
export function MinistryIntro() {
  return (
    <div className="p-10 mx-5 tiro-bangla-regular">
      <StickyScroll content={content} />
    </div>
  );
}
